Revit 2024 API
SpecTypeId.DuctSize Property
 Duct Size, in discipline HVAC.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2021
Syntax
C#
public static ForgeTypeId DuctSize { get; }
Visual Basic
Public Shared ReadOnly Property DuctSize As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ DuctSize {
	ForgeTypeId^ get ();
}
See Also
SpecTypeId Class
Autodesk.Revit.DB Namespace